app/controllers/donators_controller.rb

SELECT * FROM `donators`
---
  def index
    @donors = Donator.all

SELECT * FROM `donators`
---
  def edit
    @donors = Donator.all