app/controllers/home_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def index
    id = params[:id]
    if !id
      id = '1'
    end
      @page = Page.find(id)

SELECT * FROM `donators`
---
  def gratitude
    @donators = Donator.all