app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM `pages`

  def show
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def edit
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 3)

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`created_at`, `title`, `updated_at`, `content`, `link`) VALUES('2010-02-16 19:18:00', 'Welcome', '2010-02-16 19:18:00', 'This is what will be shown on the first page of the site. Welcome to ride for the cure.', 'Home')

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
UPDATE `pages` SET `content` = 'Many of us have a story of a loved one, close friend, a child, a grandparent who have succumbed to cancer. In 2008, a couple of us were talking after a long ride, and thought we should start an annual ride either in memory or in honor of thow we knew who had cancer, or those who are suffering with cancer. <br/> <br/>\r\nThat conversation lead to an annual ride to raise funds for cancer research and enjoy being with fellow riders. It was at Suzy\'s in Yorkville, Illinois that the enthusiasm for this annual event began to take shape! Others said they wanted to be involed and help with the next ride, and we hope to get more people involved, year after year. <br/> <br/>\r\nWe remembered Margie Wheat who introduced us in 1979. She was an inspiration and before she died, we dedicated all our efforts toward raising money for cancer research in her honor. <br/> <br/>\r\nAll proceeds go to the American Cancer Society for cancer research. Our plan is to grow in numbers and have more fun each year, so come on out and join us on our 3rd annual Ride4TheCure!!!!', `updated_at` = '2010-02-21 19:35:41', `title` = 'Why Ride', `link` = 'Why We Ride' WHERE `id` = 2

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 5)
DELETE FROM `pages` WHERE `id` = 5