app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('rmcclish', 'kdsajflaf', '2010-02-16 19:14:45', '2010-02-16 19:14:45', '123456')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-02-20 20:44:14', `salt` = '701800775421800.859669902819401', `hashed_password` = '071a724eaa4f0857fbacc04a9ecfad47aa6daaeb' WHERE `id` = 3